一、基本概念
1.数据：数据是信息的载体，是描述客观事物属性的数、字符及所有能输入到计算机中并被计算机程序识别识别和
处理的符号的集合。数据是计算机程序加工的原料。
2.数据元素、数据项：数据元素是数据的基本单位，通常作为一个整体进行考虑和处理。
一个数据元素可由若干数据项组成，数据项是构成数据元素的不可分割的最小单位。
3.数据结构、数据对象：数据结构是相互之间存在一种或多种特定关系的数据元素的集合。
数据对象是具有相同性质的数据元素的集合，是数据的一个子集。
4.数据类型、抽象数据类型：
数据类型是一个值的集合和定义在此集合上的一组操作的总称。
1)原子类型。其值不可再分的数据类型。
2)结构类型。其值可以再分解为若干成分（分量）的数据类型。
抽象数据类型（ADT）是抽象数据组织及与之相关的操作。

二、数据结构的三要素
1.逻辑结构
2.物理结构（存储结构）--如何用计算机表示数据元素的逻辑关系？
3.数据的运算

三、
1.逻辑结构分为：集合、线性结构、树形结构、图状结构（网状结构）
2.数据的存储结构：顺序存储、链式存储、索引存储、散列存储
3.数据的运算：施加在数据上的运算包括运算的定义和实现。

数据的存储结构会影响存储空间的利用率和数据操作的效率。

运算的定义是针对逻辑结构的，运算的实现是针对存储结构的。